Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Yes you can. In fact, debugging native executables on a Linux bare metal box offers the best possible experience. In this kind of environments, root access is not needed except to install packages required to run some debug steps, or to enable `perf` to gather events at the kernel.
ja_jp: Quarkusのネイティブ実行可能ファイルのデバッグは、Linux環境で行うのが最適です。一部のデバッグ手順を実行するために必要なパッケージをインストールする場合や、 `perf` でカーネルのイベントを収集できるようにする場合を除き、ルートアクセスは必要ありません。macOSやWindows環境でのデバッグは、コンテナ環境でも機能します（ link:#macwindows[FAQエントリ]を参照）。

source: Yes, Quarkus sets up a signal handler for the `SIGQUIT` signal (or `SIGBREAK` on windows) that will result in a thread dump being printed when receiving the `SIGQUIT/SIGBREAK` signal. You may use `kill -SIGQUIT <pid>` to trigger a thread dump.
ja_jp: はい、Quarkus は `SIGQUIT`シグナル (Windows では `SIGBREAK`) のシグナルハンドラーを設定し、 `SIGQUIT/SIGBREAK` シグナルを受信したときにスレッドにダンプが出力されます。 `kill -SIGQUIT` <pid>` を使用してスレッドダンプをトリガーできます。

source: Yes, but it's not the most typical pattern. See the xref:building-my-first-extension.adoc#gradle-setup[Building Your First Extension Guide] for instructions on setting up a Gradle extension. Have a look at the link:https://quarkus.io/extensions/org.jobrunr/quarkus-jobrunr/[JobRunr extension] for an example implementation.
ja_jp: はい、ただし、それは最も典型的なパターンではありません。 Gradle エクステンションの設定手順は、xref:building-my-first-extension.adoc#gradle-setup[初めてのエクステンション構築ガイド] を参照してください。実装例については link:https://quarkus.io/extensions/org.jobrunr/quarkus-jobrunr/[JobRunr エクステンション] を参照してください。

source: Yes, it is now **35 MB** whereas it used to be **46 MB**. SSL comes with a 11 MB overhead in native executable size.
ja_jp: はい、以前は *46MB* だったのが *35MB* になりました。SSLはネイティブの実行可能サイズで11MBのオーバーヘッドを持っています。

source: Yes, it is now **35 MB** whereas it used to be **46 MB**. SSL comes with an 11 MB overhead in native executable size.
ja_jp: はい、以前は **46MB** だったのが **35MB** になりました。SSLはネイティブの実行可能サイズで11MBのオーバーヘッドを持っています。

source: Yes, right now we're in the process of documenting the extra steps to make your extension releases visible to our tooling in this case.
ja_jp: はい、現在、外部のエクステンションのリリースを我々のツールから見えるようにするための追加のステップを文書化しているところです。

source: Yes, you can. In fact, in CDI the "setter injection" is superseded by more powerful https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#initializer_methods[initializer methods, window="_blank"]. Initializers may accept multiple parameters and don't have to follow the JavaBean naming conventions.
ja_jp: はい、その通りです。実際、CDIでは、「セッター・インジェクション」は、より強力な https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#initializer_methods[イニシャライザー・メソッド, window=_blank]に取って代わられています。イニシャライザは複数のパラメータを受け取ることができ、JavaBeanの命名規則に従う必要はありません。

source: Yes, you can. In fact, in CDI the "setter injection" is superseded by more powerful https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#initializer_methods[initializer methods, window="_blank"]. Initializers may accept multiple parameters and don't have to follow the JavaBean naming conventions.
ja_jp: はい、使用できます。実際、CDIでは "セッター・インジェクション "は、より強力な link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#initializer_methods[イニシャライザー・メソッド] に取って代わられています。 イニシャライザは複数のパラメータを受け取ることができ、JavaBeanの命名規則に従う必要はありません。

source: Yes, you can. In fact, in CDI the "setter injection" is superseded by more powerful https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#initializer_methods[initializer methods, window="_blank"]. Initializers may accept multiple parameters and don't have to follow the JavaBean naming conventions.
ja_jp: はい、できます。 実際、CDI では、セッターインジェクションは、より強力な https://jakarta.ee/specifications/cdi/4.1/jakarta -cdi-spec-4.1.html#initializer_methods[initializer methods、window="_blank"] に置き換えられています。 初期化子は複数のパラメーターを使用でき、JavaBean の命名規則に従う必要はありません。

source: Yes, you can. In fact, in CDI, the "setter injection" is superseded by more powerful https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#initializer_methods[initializer methods, window="_blank"]. Initializers may accept multiple parameters and don't have to follow the JavaBean naming conventions.
ja_jp: はい、できます。 実際、CDI では「セッターインジェクション」は、より強力な https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#initializer_methods[イニシャライザーメソッド, window="_blank"] に置き換えられています。 イニシャライザーは複数のパラメーターを受け入れることができ、JavaBean の命名規則に従う必要はありません。

source: Yes. In general, we distinguish:
ja_jp: はい、一般的には以下に区別しています:

source: Yet event publishers tend to describe events differently. I don't mean the content is different, but the envelope and the event's format are heterogeneous, even if these events transit on the same event mesh. Some applications choose JSON and encode everything in the event's payload; some other systems prefer binary formats, such as Avro or Protobuf, and use the protocol capability, such as headers or properties, to transport metadata about the wrapped payload. While event-driven architecture claims to ease the integration with external systems, this disparity is doing the opposite. It's not rare to need a specific event translator with the only purpose to adapt events from one format to another.
ja_jp: しかし、イベント発行者はイベントを異なる形で表現する傾向があります。内容が違うという意味ではありませんが、エンベロープとイベントのフォーマットは異種混在で、たとえこれらのイベントが同じイベントメッシュ上を通過するとしてもです。アプリケーションの中には JSON を選択してイベントのペイロードにすべてをエンコードするものもあれば、Avro や Protobuf のようなバイナリー形式を好み、ヘッダやプロパティーのようなプロトコル機能を使って、ラップされたペイロードに関するメタデータを転送するものもあります。イベント駆動型アーキテクチャは外部システムとの統合を容易にすると主張していますが、この不均衡はその逆を行っています。イベントをあるフォーマットから別のフォーマットに適応させることだけを目的とした特定のイベントトランスレータを必要とすることは珍しくありません。

source: Yet, we're not still out of the woods as invoking the `./mvnw -Prelease jreleaser:config` once more will still result in another error, this time the failure relates to missing artifacts. This is because we did not assemble all required artifacts, yet the plugin expects them to be readily available. Here you have the choice to build the required artifacts on other nodes then copy them to their expected locations -- a task that can be performed running a GitHub Actions workflow on multiple nodes. Or you can instruct JReleaser to ignore some artifacts and select only those that match your current platform. Previously we showed how the distribution would look like when created on macOS, assuming we're still on that platform we have the correct artifact.
ja_jp: それでも、 `./mvnw -Prelease jreleaser:config` をもう一度呼び出すと、別のエラーが発生するため、まだトラブルを脱していません。今回の失敗は、アーティファクトの欠落に関連しています。これは、必要なすべてのアーティファクトをアセンブルしなかったためですが、プラグインはそれらがすぐに利用できることを期待しています。ここでは、他のノードで必要なアーティファクトをビルドし、それらを予想される場所にコピーすることを選択できます。これは、複数のノードで GitHub Actions ワークフローを実行できるタスクです。または、一部のアーティファクトを無視して、現在のプラットフォームに一致するアーティファクトのみを選択するように JReleaser に指示することもできます。macOS で作成したときにディストリビューションがどのように表示されるかを前述しましたが、そのプラットフォーム上にまだ正しいアーティファクトがあると仮定しています。

source: You can either do it globally or in a specific extension directory (e.g. `extensions/mailer`).
ja_jp: グローバルに行うことも、特定のエクステンションディレクトリ ( `extensions/mailer` など) で行うこともできます。

source: You *don't need to configure anything in dev mode*. The server will be running in a random port. If you need a fixed port, then configure `quarkus.infinispan-client.devservices.port` property.
ja_jp: *devモードでは何も設定する必要はありません。* サーバーはランダムなポートで実行されます。固定ポートが必要な場合は、 `quarkus.infinispan-client.devservices.port` プロパティを設定してください。

source: You also can add environment variables to the development environment:
ja_jp: また、開発環境に環境変数を追加することもできます：

source: You also can automate the validation part we mentioned in the previous section. You can use the https://docs.ansible.com/ansible/latest/collections/ansible/builtin/assert_module.html[ansible.builtin.assert] module and populate the https://docs.ansible.com/ansible/latest/collections/ansible/builtin/service_facts_module.html#examples[service facts] to ensure the systemd service of the Quarkus app is running, along with https://docs.ansible.com/ansible/latest/collections/ansible/builtin/uri_module.html[ansible.builtin.uri] to check that the Quarkus app is accessible.
ja_jp: また、前のセクションで説明した検証部分を自動化することもできます。 link:https://docs.ansible.com/ansible/latest/collections/ansible/builtin/assert_module.html[ansible.builtin.assert] モジュールを使用し、Quarkusアプリのsystemdサービスが実行されていることを確認するために link:https://docs.ansible.com/ansible/latest/collections/ansible/builtin/service_facts_module.html#examples[サービスファクト] を入力し、Quarkusアプリがアクセス可能であることを確認するために link:https://docs.ansible.com/ansible/latest/collections/ansible/builtin/uri_module.html[ansible.builtin.uri] を入力します。

source: You also can provide a `Map<String, Object>` containing configuration values by key:
ja_jp: また、キーごとの設定値を含む `Map<String, Object>` を指定することもできます。

source: You also have the option to create a `org.acme.quartz.TaskResourceTest` test with the following content:
ja_jp: また、以下の内容で `org.acme.quartz.TaskResourceTest` テストを作成するオプションもあります:

source: You also have the possibility to store password using different hashing algorithm `@Password(value = PasswordType.CUSTOM, provider = CustomPasswordProvider.class)`:
ja_jp: また、異なるハッシュアルゴリズム（ `@Password(value = PasswordType.CUSTOM, provider = CustomPasswordProvider.class)` ）を使用してパスワードを保存することもできます。

source: You also have to configure the Hibernate processor, which is required:
ja_jp: また、必須の Hibernate プロセッサーを設定する必要があります。

source: You also have to fill the `quarkus-extension.yaml` file that describe your extension inside the runtime module `src/main/resources/META-INF` folder.
ja_jp: また、実行時モジュールの `src/main/resources/META-INF` フォルダー内の、エクステンションについて説明する `quarkus-extension.yaml` ファイルを記入する必要があります。

source: You also have to fill the xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] template file that describe your extension inside the runtime module `src/main/resources/META-INF` folder.
ja_jp: また、ランタイムモジュール `src/main/resources/META-INF` フォルダ内に、エクステンションを記述した xref:extension-metadata.adoc#quarkus-extension-yaml[quarkus-extension.yaml] テンプレートファイルを記述する必要があります。

source: You also need a GitHub Personal Access token to be able to post a release to the repository you just created. Follow the official documentation for link:https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token[creating a personal access token]. Store the newly created token at a safe place for future reference. Next, you have the choice of configuring the token as an environment variable named `JRELEASER_GITHUB_TOKEN` so that the tool can read it. Alternatively you may store the token at a secure location of your choosing, using a `.yml`, `.toml`, `.json`, or `.properties` file. The default location is `~/.jreleaser/config[format]`. For example, using the `.yml` format this file could look like:
ja_jp: また、作成したリポジトリにリリースを投稿するためには、GitHub パーソナルアクセストークンが必要です。 link:https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/creating-a-personal-access-token[パーソナルアクセストークンの作成]方法は、公式ドキュメントに従ってください。作成したトークンは、今後のために安全な場所に保管しておきましょう。次に、トークンを環境変数 `JRELEASER_GITHUB_TOKEN` として設定し、ツールに読み込ませる方法があります。あるいは、 `.yml` 、 `.toml` 、 `.json` 、 `.properties` のいずれかのファイルを使用して、トークンを安全な場所に保存することもできます。デフォルトの場所は `~/.jreleaser/config[format]` です。例えば、 `.yml` のフォーマットを使用した場合、このファイルは次のようになります。

source: You also need to add the following at the top of your `settings.gradle` file:
ja_jp: また、 `settings.gradle` ファイルの先頭に以下を追加する必要があります。

source: You also need to adjust the minimum log level for the relevant category.
ja_jp: また、関連するカテゴリーの最小ログレベルを調整する必要があります。

source: You also need to configure the Auth0 application to allow the callbacks to the OIDC Dev UI. Use the following URL format:
ja_jp: また、OIDC Dev UI へのコールバックを許可するように Auth0 アプリケーションを設定する必要もあります。 次の URL 形式を使用します。

source: You also need to make sure that you are using Java 19 or later (we recommend 21+), this can be enforced in your `pom.xml` file with the following:
ja_jp: Java 19 以降 (推奨は 21 以降) を使用していることを確認する必要があります。これは、次のように `pom.xml` ファイルで強制できます。

source: You also need to make sure that you are using the version 19 of Java, this can be enforced in your pom.xml file with the following:
ja_jp: また、Javaのバージョン19を使用する必要があります。これは、pom.xmlファイルで次のように指定することができます:

source: You also need to set the `quarkus.oidc.user-info-path` property to a URL endpoint that fetches the user info (or to an endpoint protected by the access token). For GitHub, since it does not have an introspection endpoint, requesting the UserInfo is required.
ja_jp: また、 `quarkus.oidc.user-info-path` プロパティーを、ユーザー情報を取得する URL エンドポイント (またはアクセストークンによって保護されたエンドポイント) に設定する必要もあります。 GitHub の場合、イントロスペクションエンドポイントがないため、UserInfo をリクエストする必要があります。

source: You also need to ship the AOT cache, which means container images will be significantly larger than with native executables.
ja_jp: また、AOT キャッシュも配布する必要があり、これはコンテナーイメージがネイティブ実行可能ファイルよりも大幅に大きくなることを意味します。

source: You are most likely to see a behavior change if you have customized the HTTP root path. In that case, we hope the new rules and examples above will help you understand how to tweak your configuration to get everything to behave the way you want it to.
ja_jp: HTTP ルートパスをカスタマイズしている場合は、挙動の変化に気づく可能性が高いでしょう。その場合は、上記の新しいルールと例が、設定を微調整してすべてを思い通りに動作させる方法を理解するのに役立つことを願っています。

source: You are prompted for the required information such as server URL, password, and so on.
ja_jp: サーバーのURLやパスワードなど、必要な情報の入力を求められます。

source: You are redirected again to the Keycloak login page. However, this time, you are going to authenticate by using a different realm.
ja_jp: Keycloak ログインページに再度リダイレクトされます。 ただし、今回は別のレルムを使用して認証します。

source: You are working in the correct OpenShift project namespace.
ja_jp: 正しい OpenShift プロジェクトの名前空間で作業していること

source: You are working in the correct {openshift} project namespace.
ja_jp: 正しい {openshift} プロジェクトの名前空間で作業していること

source: You calculate the session age by adding the lifespan value of the current ID token and the values of the `quarkus.oidc.authentication.session-age-extension` and `quarkus.oidc.token.lifespan-grace` properties.
ja_jp: セッションの有効期間は、現在の ID トークンの有効期間の値と、 `quarkus.oidc.authentication.session-age-extension` プロパティーおよび `quarkus.oidc.token.lifespan-grace` プロパティーの値を加算して計算します。

source: You can (optionally) add the title, else it will be derived from the component link.
ja_jp: タイトルを (任意で) 追加できます。追加しない場合、タイトルはコンポーネントリンクから導出されます。

source: You can (optionally) hint the content type of the content you are navigating to. If there is no hint, a header call will be made to determine the `MediaType`;
ja_jp: 移動先のコンテンツのコンテンツタイプを (オプションで) ヒントとして表示できます。ヒントがない場合、 `MediaType` を決定するためにヘッダー呼び出しが実行されます。

source: You can `create` your function using the following command:
ja_jp: 次のコマンドを使って、 Function を `create` します。

source: You can access information about authorization in different ways.
ja_jp: 認可に関する情報には、さまざまな方法でアクセスできます。

source: You can access the generated value using the `quarkus.uuid` property. Use <<property-expressions, expressions>> to access it: `${quarkus.uuid}`. For example, it can be useful to configure a Kafka client with a unique consumer group:
ja_jp: 生成された値には、 `quarkus.uuid` プロパティーを使用してアクセスできます。<<property-expressions, expressions>> を使用してアクセスします (`${quarkus.uuid}`)。たとえば、Kafka クライアントを一意のコンシューマーグループで設定する場合に便利です。

source: You can access the generated value using the `quarkus.uuid` property. Use <<property-expressions,expressions>> to access it: `${quarkus.uuid}`. For example, it can be useful to configure a Kafka client with a unique consumer group:
ja_jp: 生成された値には、 `quarkus.uuid` プロパティーを使用してアクセスできます。アクセスするには、<<property-expressions,expressions>> を使用します (`${quarkus.uuid}`)。たとえば、一意のコンシューマーグループを使用して Kafka クライアントを設定する場合に便利です。

source: You can access the generated value using the `quarkus.uuid` property. Use xref:property-expressions[expressions] to access it: `${quarkus.uuid}`. For example, it can be useful to configure a Kafka client with a unique consumer group:
ja_jp: 生成された値には、 `quarkus.uuid` プロパティを使用してアクセスすることができます。アクセスするには xref:property-expressions[式] を使用します: `${quarkus.uuid}` 。たとえば、Kafka クライアントに一意のコンシューマーグループを設定するのに便利です:

source: You can access the log of the assistant in the Dev UI Footer:
ja_jp: Dev UI のフッターからアシスタントのログにアクセスできます:

source: You can access the path parameter values using the `io.quarkus.websockets.next.WebSocketConnection#pathParam(String)` method, or `io.quarkus.websockets.next.WebSocketClientConnection#pathParam(String)` respectively. Alternatively, an endpoint callback method parameter annotated with `@io.quarkus.websockets.next.PathParam` is injected automatically.
ja_jp: パスパラメーター値には、それぞれ `io.quarkus.websockets.next.WebSocketConnection#pathParam(String)` メソッドまたは `io.quarkus.websockets.next.WebSocketClientConnection#pathParam(String)` を使用してアクセスできます。 あるいは、 `@io.quarkus.websockets.next.PathParam` アノテーションが付与されたエンドポイントコールバックメソッドパラメーターが自動的に注入されます。

source: You can access your Keycloak Server at http://localhost:8180[localhost:8180].
ja_jp: Keycloak サーバーには http://localhost:8180[localhost:8180] からアクセスできます。

source: You can access your Keycloak server at http://localhost:8180[localhost:8180].
ja_jp: Keycloak サーバーには http://localhost:8180[localhost:8180] からアクセスできます。

source: You can achieve that by adapting the previous build step to use a static-init recorder instead of registering classes for reflection:
ja_jp: これは、リフレクション用のクラスを登録する代わりに、static-init レコーダを使用するように前のビルドステップを適合させることで実現できます。

source: You can achieve this by injecting a `SecurityIdentity` instance into your beans, as shown in the following example. Or, you can get the same result by annotating the resource method with `@PermissionsAllowed`. The following example demonstrates three resource methods, each requiring the same `read` scope:
ja_jp: 次の例に示すように、Bean に `SecurityIdentity` インスタンスを注入することでこれを実現できます。 または、リソースメソッドに `@PermissionsAllowed` アノテーションを付与することで同じ結果を得ることができます。 次の例は、それぞれ同じ `read` スコープを必要とする 3 つのリソースメソッドを示しています。

source: You can activate Gradle remote debugging by using the flags `org.gradle.debug=true` or `org.gradle.daemon.debug=true` in daemon mode. You can launch your application with the following command line:
ja_jp: Gradle のリモートデバッグは、デーモンモードでフラグ `org.gradle.debug=true` または `org.gradle.daemon.debug=true` を使用して有効にすることができます。以下のコマンドラインでアプリケーションを起動することができます。

source: You can activate Maven remote debugging by using `mvnDebug`. You can launch your application with the following command line:
ja_jp: `mvnDebug` を使用して、Maven リモートデバッグを有効にすることができます。以下のコマンドラインでアプリケーションを起動できます。

source: You can add HTTP request logging by configuring it in `application.properties`. There are two options for logging, either logging to the standard JBoss logging output, or logging to a dedicated file.
ja_jp: `application.properties` で設定することで、HTTP リクエストのロギングを追加することができます。ロギングには、標準の JBoss ロギング出力にロギングするか、専用ファイルにロギングするかの 2 つのオプションがあります。

source: You can add `OWASP Dependency Check Plugin` to your project's `pom.xml` like this:
ja_jp: 以下のように、プロジェクトの `pom.xml` に `OWASP Dependency Check Plugin` を追加できます。

source: You can add a custom certificate chain validation step by registering a custom `quarkus.oidc.TokenCertificateValidator`, for example:
ja_jp: カスタムの `quarkus.oidc.TokenCertificateValidator` を登録することで、カスタムの証明書チェーン検証ステップを追加できます。次に例を示します。

source: You can add a https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie property to any of the cookies set by a Quarkus endpoint. For more information, see xref:http-reference.adoc#same-site-cookie[SameSite cookies].
ja_jp: Quarkusのエンドポイントが設定するCookieのいずれにも、 link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] Cookieプロパティを追加することができます。詳細については、 xref:http-reference.adoc#same-site-cookie[SameSite cookies] を参照してください。

source: You can add a link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie property to any of the cookies set by a Quarkus endpoint. For more information, see the xref:http-reference.adoc#same-site-cookie[SameSite cookies] section of the Quarkus "HTTP reference" guide.
ja_jp: Quarkus エンドポイントによって設定される Cookie に、link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] Cookie プロパティーを追加できます。 詳細は、Quarkus「HTTP リファレンスガイド」の xref:http-reference.adoc#same-site-cookie[SameSite Cookie] セクションを参照してください。

source: You can add a permission checker through `io.quarkus.security.runtime.QuarkusSecurityIdentity.Builder#addPermissionChecker`.
ja_jp: `io.quarkus.security.runtime.QuarkusSecurityIdentity.Builder#addPermissionChecker` により権限チェッカーを追加できます。

source: You can add additional attributes by setting the `quarkus.otel.resource.attributes` config property that is described in the <<configuration-reference>>. Since this property can be overridden at runtime, the OpenTelemetry extension will pick up its value following the order of precedence that is described in the xref:config-reference.adoc#configuration-sources[Quarkus Configuration Reference].
ja_jp: <<configuration-reference>> に記載されている `quarkus.otel.resource.attributes` config プロパティーを設定することで、さらに属性を追加できます。 このプロパティーは実行時にオーバーライドできるため、OpenTelemetry エクステンションは、 xref:config-reference.adoc#configuration-sources[Quarkus Configuration Reference] に記載されている優先順位に従ってその値をピックアップします。

source: You can add additional methods to the generated resources by the REST Data with Panache extension by adding these methods to the resource interface, for example:
ja_jp: REST Data with Panache エクステンションによって生成されたリソースに対して、リソースインターフェイスにこれらのメソッドを追加することで、追加メソッドを追加することができます。例:

source: You can add an assistant function to a workspace item using the same approach as regular xref:dev-ui.adoc#workspace[workspace actions], with one key difference: instead of using `.function(...)`, you use `.assistantFunction(...)`.
ja_jp: 通常の xref:dev-ui.adoc#workspace[ワークスペースアクション] と同じアプローチでワークスペースアイテムにアシスタント機能を追加できますが、 1 つだけ重要な違いがあります。それは `.function(...)` の代わりに `.assistantFunction(...)` を使用することです。

source: You can add an error code on the error output in the GraphQL response by using the (SmallRye specific) `@ErrorCode`:
ja_jp: (SmallRye特有の) `@ErrorCode` を使用することで、GraphQLレスポンスのエラー出力にエラーコードを追加することができます。

source: You can add an extension using:
ja_jp: 以下を使ってエクステンションを追加できます。

source: You can add an icon. All free font-awesome icons are available.
ja_jp: アイコンを追加できます。無料の font-awesome アイコンが利用可能です。

source: You can add an icon. All free https://fontawesome.com/icons[font-awesome] icons are available.
ja_jp: アイコンを追加できます。すべての無料の https://fontawesome.com/icons[font-awesome] アイコンが利用可能です。

source: You can add an option label to the link in the card using one of the builder methods on the page builder. These labels can be
ja_jp: ページビルダーのビルダーメソッドの 1 つを使用して、カード内のリンクにオプションラベルを追加できます。以下のラベルがあります。

source: You can add an optional label to the link in the card using one of the builder methods on the page builder. These labels can be
ja_jp: ページビルダーのいずれかのビルダーメソッドを使用して、カード内のリンクにオプションのラベルを追加できます。これらのラベルは次のとおりです。

source: You can add an underlying library badge on the card. This is useful for cases where the extension is exposing a well known library. As example, the `quarkus-hibernate-orm` extension provides access to Hibernate. Showing the underlying Hibernate details could be useful information for the user:
ja_jp: カードに基盤となるライブラリーバッジを追加できます。これは、エクステンションがよく知られたライブラリーを公開している場合に便利です。例えば、`quarkus-hibernate-orm` エクステンションは Hibernate へのアクセスを提供します。基盤となる Hibernate の詳細を表示することは、ユーザーにとって有用な情報となる可能性があります。

source: You can add attributes by setting the `resource-attributes` tracer config that is described in the <<configuration-reference>>. Since this property can be overridden at runtime, the OpenTelemetry extension will pick up its value following the order of precedence that is described in the xref:config-reference.adoc#configuration-sources[Quarkus Configuration Reference].
ja_jp: <<configuration-reference,設定リファレンス>> に記述されている `resource-attributes` トレーサーの設定を行うことで属性を追加することができます。 このプロパティは実行時にオーバーライドできるので、OpenTelemetry 拡張は xref:config-reference.adoc#configuration-sources[Quarkus 設定リファレンス] に記述されている優先順位に従ってその値を取得します。
